import streamlit as st
import requests
import pandas as pd
import numpy as np
import plotly.express as px
from plotly.subplots import make_subplots
import plotly.graph_objects as go
import matplotlib.pyplot as plt



st.title("Тема проекта")
st.sidebar.title("Фильтр по показателям и банкам")
st.markdown("Здесь что-то можно написать")
st.sidebar.markdown("И здесь что-то можно написать")


#url_all='https://bank.gov.ua/NBUStatService/v1/statdirectory/banksfinrep?start=20180101&period=m&json'
#def get_dict():
    #r = requests.get(url_all)
    #source_all=r.json()
    #mfo_list=list(set([(i['mfo']) for i in source_all]))
    #fullname_list=list(set([(i['fullname']) for i in source_all]))
    #name_pair = [(i['fullname'],i['mfo']) for i in source_all]
    #name_pair = set(name_pair)
    #return mfo_list,fullname_list,name_pair


#mfo_list,fullname_list,name_pair= get_dict()
name_pair=[('АБ "КЛІРИНГОВИЙ ДІМ"', '300647'),
 ('АБ "УКРГАЗБАНК"', '320478'),
 ('АКБ "ІНДУСТРІАЛБАНК"', '313849'),
 ('АТ "ЄПБ"', '377090'),
 ('АТ "ІНГ Банк Україна"', '300539'),
 ('АТ "Ідея Банк"', '336310'),
 ('АТ "А - БАНК"', '307770'),
 ('АТ "АБ "РАДАБАНК"', '306500'),
 ('АТ "АЙБОКС БАНК"', '322302'),
 ('АТ "АКБ "КОНКОРД"', '307350'),
 ('АТ "АЛЬПАРІ БАНК"', '380894'),
 ('АТ "АЛЬТБАНК"', '320940'),
 ('АТ "АЛЬФА-БАНК"', '300346'),
 ('АТ "АП БАНК"', '380548'),
 ('АТ "АСВІО БАНК"', '353489'),
 ('АТ "БАНК "ГРАНТ"', '351607'),
 ('АТ "БАНК "ПОРТАЛ"', '339016'),
 ('АТ "БАНК "УКРАЇНСЬКИЙ КАПІТАЛ"', '320371'),
 ('АТ "БАНК 3/4"', '380645'),
 ('АТ "БАНК ІНВЕСТИЦІЙ ТА ЗАОЩАДЖЕНЬ"', '380281'),
 ('АТ "БАНК АВАНГАРД"', '380946'),
 ('АТ "БАНК АЛЬЯНС"', '300119'),
 ('АТ "БАНК КРЕДИТ ДНІПРО"', '305749'),
 ('АТ "БАНК СІЧ"', '380816'),
 ('АТ "БАНК ТРАСТ-КАПІТАЛ"', '380106'),
 ('АТ "БАНК ФОРВАРД"', '380418'),
 ('АТ "БМ БАНК"', '380913'),
 ('АТ "БТА БАНК"', '321723'),
 ('АТ "ВЕРНУМ БАНК"', '380689'),
 ('АТ "ВТБ БАНК"', '321767'),
 ('АТ "Дойче Банк ДБУ"', '380731'),
 ('АТ "КІБ"', '322540'),
 ('АТ "КБ "ГЛОБУС"', '380526'),
 ('АТ "КБ "ЗЕМЕЛЬНИЙ КАПІТАЛ"', '305880'),
 ('АТ "КОМІНВЕСТБАНК"', '312248'),
 ('АТ "КРЕДІ АГРІКОЛЬ БАНК"', '300614'),
 ('АТ "КРЕДИТ ЄВРОПА БАНК"', '380366'),
 ('АТ "КРЕДИТВЕСТ БАНК"', '380441'),
 ('АТ "КРЕДОБАНК"', '325365'),
 ('АТ "КРИСТАЛБАНК"', '339050'),
 ('АТ "МІБ"', '380582'),
 ('АТ "МЕГАБАНК"', '351629'),
 ('АТ "МОТОР-БАНК"', '313009'),
 ('АТ "МетаБанк"', '313582'),
 ('АТ "Місто Банк"', '328760'),
 ('АТ "ОКСІ БАНК"', '325990'),
 ('АТ "ОТП БАНК"', '300528'),
 ('АТ "Ощадбанк"', '300465'),
 ('АТ "ПІРЕУС БАНК МКБ"', '300658'),
 ('АТ "ПЕРШИЙ ІНВЕСТИЦІЙНИЙ БАНК"', '300506'),
 ('АТ "ПРАВЕКС БАНК"', '380838'),
 ('АТ "ПРОКРЕДИТ БАНК"', '320984'),
 ('АТ "ПУМБ"', '334851'),
 ('АТ "Полтава-банк"', '331489'),
 ('АТ "РВС БАНК"', '339072'),
 ('АТ "Райффайзен Банк Аваль"', '300335'),
 ('АТ "СІТІБАНК"', '300584'),
 ('АТ "СБЕРБАНК"', '320627'),
 ('АТ "СЕБ КОРПОРАТИВНИЙ БАНК"', '380797'),
 ('АТ "СКАЙ БАНК"', '351254'),
 ('АТ "ТАСКОМБАНК"', '339500'),
 ('АТ "УКРБУДІНВЕСТБАНК"', '380377'),
 ('АТ "УКРСИББАНК"', '351005'),
 ('АТ "УКРСОЦБАНК"', '300023'),
 ('АТ "УНІВЕРСАЛ БАНК"', '322001'),
 ('АТ "Український банк реконструкції та розвитку"', '380883'),
 ('АТ "Укрексімбанк"', '322313'),
 ('АТ "ЮНЕКС БАНК"', '322539'),
 ('АТ АКБ "АРКАДА"', '322335'),
 ('АТ АКБ "Львів"', '325268'),
 ('АТ КБ "ПриватБанк"', '305299'),
 ('Акціонерний банк "Південний"', '328209'),
 ('ПАТ "БАНК "ЮНІСОН"', '380902'),
 ('ПАТ "БАНК ВОСТОК"', '307123'),
 ('ПАТ "ВіЕс Банк"', '325213'),
 ('ПАТ "ДІВІ БАНК"', '380827'),
 ('ПАТ "КБ "ФІНАНСОВА ІНІЦІАТИВА"', '380054'),
 ('ПАТ "МТБ БАНК"', '328168'),
 ('ПАТ "Промінвестбанк"', '300012'),
 ('ПАТ "РОЗРАХУНКОВИЙ ЦЕНТР"', '344443'),
 ('ПАТ КБ "Центр"', '380742'),
 ('Полікомбанк', '353100'),
 ('ПрАТ "БАНК ФАМІЛЬНИЙ"', '334840'),
 ('ПуАТ "КБ "АКОРДБАНК"', '380634')]
name_list=[i[0] for i in name_pair]
choice = st.sidebar.multiselect('Pick bank', (name_list), key=0)

mfos=[i[1] for i in name_pair if i[0] in choice]


def get_data(mfo,id_api):
    BASE_URL = 'https://bank.gov.ua/NBUStatService/v1/statdirectory/banksfinrep?mfo={mfo}&id_api={id_api}&start=20180101&period=m&json'
    url = BASE_URL.format(mfo=mfo,id_api=id_api)
    r = requests.get(url)
    source=r.json()
    return source

da=[]
for i in mfos:
    da+=get_data(i,id_api='BS1_AssetsCash')
df=pd.DataFrame(da)
df['dt']=pd.to_datetime(df.dt)
df=df.groupby([df.dt,df.mfo,df.fullname]).value.sum().reset_index()
fig_1 = px.line(df, x='dt', y='value', color='fullname', height=500,width=1000)
st.write("id_api='BS1_AssetsCash'")
st.plotly_chart(fig_1)
st.write(df)
